AccumulationRegisters/Renault_БСОВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_БСОВОрганизации</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Renault_БСОНаТочкеПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_БСОНаТочкеПродаж</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Renault_ПоступлениеБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ПоступлениеБСО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Renault_БСОНаТочкеПродаж</xr:Item>
				<xr:Item>InformationRegister.Renault_СтатусыБСО</xr:Item>
				<xr:Item>AccumulationRegister.Renault_БСОВОрганизации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередатьНаТочкуПродажи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БСО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипБСО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияБСО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБСОНач</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБСОКон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/Renault_УчетБСО/Ext/Module.bsl
Процедура ПечатьАктаПриемаПередачиБСО(Дата, Номер, Выдал, Принял, ТабЧасть) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("Renault_АктПриемаПередачиБСО");	
    ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Дата = Дата;
	ОбластьШапка.Параметры.Номер = Номер;
	ОбластьШапка.Параметры.Выдал = Выдал;
	ОбластьШапка.Параметры.Принял = Принял;
	
	ТабДок.Вывести(ОбластьШапка);
	
    ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	НомерПоПорядку = 1;
	Для Каждого Строка Из ТабЧасть Цикл;

		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
		ОбластьСтрока.Параметры.НомерПоПорядку = НомерПоПорядку;
		ТабДок.Вывести(ОбластьСтрока);
		
		НомерПоПорядку = НомерПоПорядку + 1;

	КонецЦикла;	
	
    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Выдал = "(" + Выдал + ")";
	ОбластьПодвал.Параметры.Принял = "(" + Принял + ")";
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.Показать();
	
КонецПроцедуры

Функция ПолучитьБСОВОрганизации(Дата, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_БСОВОрганизацииОстатки.Организация,
	               |	Renault_БСОВОрганизацииОстатки.СтраховаяКомпания,
	               |	Renault_БСОВОрганизацииОстатки.ТипБСО,
	               |	Renault_БСОВОрганизацииОстатки.СерияБСО,
	               |	Renault_БСОВОрганизацииОстатки.НомерБСО,
	               |	СУММА(Renault_БСОВОрганизацииОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.Renault_БСОВОрганизации.Остатки(&Дата, Организация = &Организация) КАК Renault_БСОВОрганизацииОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_БСОВОрганизацииОстатки.НомерБСО,
	               |	Renault_БСОВОрганизацииОстатки.СерияБСО,
	               |	Renault_БСОВОрганизацииОстатки.СтраховаяКомпания,
	               |	Renault_БСОВОрганизацииОстатки.Организация,
	               |	Renault_БСОВОрганизацииОстатки.ТипБСО
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(Renault_БСОВОрганизацииОстатки.КоличествоОстаток) > 0";
				   
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат ПолучитьПустуюТаблицуБСО(); 	
	Иначе
		Возврат Результат.Выгрузить();	
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьБСОНаТочке(Дата, Организация, ТочкаПродаж)
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ТочкаПродаж", ТочкаПродаж);
	Запрос.Текст="ВЫБРАТЬ
	               |	Renault_БСОНаТочкеПродажОстатки.Организация,
	               |	Renault_БСОНаТочкеПродажОстатки.ТочкаПродаж,
	               |	Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания,
	               |	Renault_БСОНаТочкеПродажОстатки.ТипБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.СерияБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.НомерБСО,
	               |	СУММА(Renault_БСОНаТочкеПродажОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.Renault_БСОНаТочкеПродаж.Остатки(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И ТочкаПродаж = &ТочкаПродаж) КАК Renault_БСОНаТочкеПродажОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_БСОНаТочкеПродажОстатки.Организация,
	               |	Renault_БСОНаТочкеПродажОстатки.ТипБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.ТочкаПродаж,
	               |	Renault_БСОНаТочкеПродажОстатки.НомерБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания,
	               |	Renault_БСОНаТочкеПродажОстатки.СерияБСО
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(Renault_БСОНаТочкеПродажОстатки.КоличествоОстаток) > 0";
				   
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат ПолучитьПустуюТаблицуБСО(); 	
	Иначе
		Возврат Результат.Выгрузить();	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьБСОНаТочках(Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	//Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_БСОНаТочкеПродажОстатки.Организация,
	               |	Renault_БСОНаТочкеПродажОстатки.ТочкаПродаж,
	               |	Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания,
	               |	Renault_БСОНаТочкеПродажОстатки.ТипБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.СерияБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.НомерБСО,
	               |	СУММА(Renault_БСОНаТочкеПродажОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.Renault_БСОНаТочкеПродаж.Остатки(, Организация = &Организация) КАК Renault_БСОНаТочкеПродажОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_БСОНаТочкеПродажОстатки.Организация,
	               |	Renault_БСОНаТочкеПродажОстатки.ТипБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.ТочкаПродаж,
	               |	Renault_БСОНаТочкеПродажОстатки.НомерБСО,
	               |	Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания,
	               |	Renault_БСОНаТочкеПродажОстатки.СерияБСО
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(Renault_БСОНаТочкеПродажОстатки.КоличествоОстаток) > 0";
				   
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат ПолучитьПустуюТаблицуБСО(); 	
	Иначе
		Возврат Результат.Выгрузить();	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьБСОВОрганизацииНеПереданныеНаТочки(Дата, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйБСОВОрганизации.Организация,
	               |	ВложенныйБСОВОрганизации.СтраховаяКомпания,
	               |	ВложенныйБСОВОрганизации.ТипБСО,
	               |	ВложенныйБСОВОрганизации.СерияБСО,
	               |	ВложенныйБСОВОрганизации.НомерБСО,
	               |	ВложенныйБСОВОрганизации.Количество - ЕСТЬNULL(ВложенныйБСОНаТочках.Количество, 0) КАК Количество
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Renault_БСОВОрганизацииОстатки.Организация КАК Организация,
	               |		Renault_БСОВОрганизацииОстатки.СтраховаяКомпания КАК СтраховаяКомпания,
	               |		Renault_БСОВОрганизацииОстатки.ТипБСО КАК ТипБСО,
	               |		Renault_БСОВОрганизацииОстатки.СерияБСО КАК СерияБСО,
	               |		Renault_БСОВОрганизацииОстатки.НомерБСО КАК НомерБСО,
	               |		СУММА(Renault_БСОВОрганизацииОстатки.КоличествоОстаток) КАК Количество
	               |	ИЗ
	               |		РегистрНакопления.Renault_БСОВОрганизации.Остатки(&Дата, Организация = &Организация) КАК Renault_БСОВОрганизацииОстатки
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Renault_БСОВОрганизацииОстатки.НомерБСО,
	               |		Renault_БСОВОрганизацииОстатки.СерияБСО,
	               |		Renault_БСОВОрганизацииОстатки.СтраховаяКомпания,
	               |		Renault_БСОВОрганизацииОстатки.Организация,
	               |		Renault_БСОВОрганизацииОстатки.ТипБСО
	               |	
	               |	ИМЕЮЩИЕ
	               |		СУММА(Renault_БСОВОрганизацииОстатки.КоличествоОстаток) > 0) КАК ВложенныйБСОВОрганизации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Renault_БСОНаТочкеПродажОстатки.Организация КАК Организация,
	               |			Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания КАК СтраховаяКомпания,
	               |			Renault_БСОНаТочкеПродажОстатки.ТипБСО КАК ТипБСО,
	               |			Renault_БСОНаТочкеПродажОстатки.СерияБСО КАК СерияБСО,
	               |			Renault_БСОНаТочкеПродажОстатки.НомерБСО КАК НомерБСО,
	               |			СУММА(Renault_БСОНаТочкеПродажОстатки.КоличествоОстаток) КАК Количество
	               |		ИЗ
	               |			РегистрНакопления.Renault_БСОНаТочкеПродаж.Остатки(&Дата, Организация = &Организация) КАК Renault_БСОНаТочкеПродажОстатки
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			Renault_БСОНаТочкеПродажОстатки.Организация,
	               |			Renault_БСОНаТочкеПродажОстатки.ТипБСО,
	               |			Renault_БСОНаТочкеПродажОстатки.НомерБСО,
	               |			Renault_БСОНаТочкеПродажОстатки.СтраховаяКомпания,
	               |			Renault_БСОНаТочкеПродажОстатки.СерияБСО
	               |		
	               |		ИМЕЮЩИЕ
	               |			СУММА(Renault_БСОНаТочкеПродажОстатки.КоличествоОстаток) > 0) КАК ВложенныйБСОНаТочках
	               |		ПО ВложенныйБСОВОрганизации.Организация = ВложенныйБСОНаТочках.Организация
	               |			И ВложенныйБСОВОрганизации.СтраховаяКомпания = ВложенныйБСОНаТочках.СтраховаяКомпания
	               |			И ВложенныйБСОВОрганизации.ТипБСО = ВложенныйБСОНаТочках.ТипБСО
	               |			И ВложенныйБСОВОрганизации.СерияБСО = ВложенныйБСОНаТочках.СерияБСО
	               |			И ВложенныйБСОВОрганизации.НомерБСО = ВложенныйБСОНаТочках.НомерБСО
	               |ГДЕ
	               |	ВложенныйБСОВОрганизации.Количество - ЕСТЬNULL(ВложенныйБСОНаТочках.Количество, 0) > 0";
				   
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат ПолучитьПустуюТаблицуБСО(); 	
	Иначе
		Возврат Результат.Выгрузить();	
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПустуюТаблицуБСО() Экспорт
	ТаблицаБСО = Новый ТаблицаЗначений();
	ТаблицаБСО.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Массив=Новый Массив; 
	Массив.Добавить(Тип("СправочникСсылка.Контрагенты"));
	Массив.Добавить(Тип("СправочникСсылка.Банки"));
	ТаблицаБСО.Колонки.Добавить("СтраховаяКомпания", Новый ОписаниеТипов(Массив));
	ТаблицаБСО.Колонки.Добавить("ТочкаПродаж", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаБСО.Колонки.Добавить("ТипБСО", Новый ОписаниеТипов("СправочникСсылка.Renault_ТипыБСО"));
	ТаблицаБСО.Колонки.Добавить("СерияБСО", Новый ОписаниеТипов("СправочникСсылка.Renault_СерииБСО"));
	ТаблицаБСО.Колонки.Добавить("НомерБСО", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10)));
	ТаблицаБСО.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	Возврат ТаблицаБСО;
КонецФункции

Функция ПроверитьНаличиеБСО(Дата, ТаблицаБСО, Организация, СтраховаяКомпания = неопределено, ТочкаПродаж = неопределено, НеобходимоНаличие = ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.УстановитьПараметр("ТаблицаБСО", ТаблицаБСО);
	
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ТаблицаБСО ИЗ &ТаблицаБСО КАК ТаблицаБСО";
	Запрос.Выполнить();
	
	Если ТочкаПродаж = неопределено Тогда
		
		Запрос.УстановитьПараметр("БСОВОрганизации", ПолучитьБСОВОрганизации(Дата, Организация));
		
		Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_БСОВОрганизации ИЗ &БСОВОрганизации КАК БСОВОрганизации";
		Запрос.Выполнить();
		
		Если НеобходимоНаличие Тогда
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ВТ_ТаблицаБСО.Организация,
			               |	ВТ_ТаблицаБСО.СтраховаяКомпания,
			               |	ВТ_ТаблицаБСО.ТипБСО,
			               |	ВТ_ТаблицаБСО.СерияБСО,
			               |	ВТ_ТаблицаБСО.НомерБСО,
			               |	ВТ_ТаблицаБСО.Количество
			               |ИЗ
			               |	ВТ_ТаблицаБСО КАК ВТ_ТаблицаБСО
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БСОВОрганизации КАК ВТ_БСОВОрганизации
			               |		ПО ВТ_ТаблицаБСО.Организация = ВТ_БСОВОрганизации.Организация
			               |			И ВТ_ТаблицаБСО.СтраховаяКомпания = ВТ_БСОВОрганизации.СтраховаяКомпания
			               |			И ВТ_ТаблицаБСО.ТипБСО = ВТ_БСОВОрганизации.ТипБСО
			               |			И ВТ_ТаблицаБСО.СерияБСО = ВТ_БСОВОрганизации.СерияБСО
			               |			И ВТ_ТаблицаБСО.НомерБСО = ВТ_БСОВОрганизации.НомерБСО
			               |ГДЕ
			               |	ВТ_БСОВОрганизации.НомерБСО ЕСТЬ NULL ";
						   
			Результат = Запрос.Выполнить();
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Сообщить("Бланк " + Выборка.СерияБСО + " " + Выборка.НомерБСО + " не принят в организацию");
			КонецЦикла;	
				
			Возврат Результат.Пустой();
			
		Иначе	
		
			Запрос.Текст = "ВЫБРАТЬ
			               |	ВТ_ТаблицаБСО.Организация,
			               |	ВТ_ТаблицаБСО.СтраховаяКомпания,
			               |	ВТ_ТаблицаБСО.ТипБСО,
			               |	ВТ_ТаблицаБСО.СерияБСО,
			               |	ВТ_ТаблицаБСО.НомерБСО,
			               |	ВТ_ТаблицаБСО.Количество
			               |ИЗ
			               |	ВТ_ТаблицаБСО КАК ВТ_ТаблицаБСО
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_БСОВОрганизации КАК ВТ_БСОВОрганизации
			               |		ПО ВТ_ТаблицаБСО.Организация = ВТ_БСОВОрганизации.Организация
			               |			И ВТ_ТаблицаБСО.СтраховаяКомпания = ВТ_БСОВОрганизации.СтраховаяКомпания
			               |			И ВТ_ТаблицаБСО.ТипБСО = ВТ_БСОВОрганизации.ТипБСО
			               |			И ВТ_ТаблицаБСО.СерияБСО = ВТ_БСОВОрганизации.СерияБСО
			               |			И ВТ_ТаблицаБСО.НомерБСО = ВТ_БСОВОрганизации.НомерБСО";
						   
			Результат = Запрос.Выполнить();
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Сообщить("Бланк " + Выборка.СерияБСО + " " + Выборка.НомерБСО + " уже принят в организацию");
			КонецЦикла;	
				
			Возврат НЕ Результат.Пустой();
			
		КонецЕсли;	
		
	Иначе
		
		Запрос.УстановитьПараметр("БСОНаТочке", ПолучитьБСОНаТочке(Дата, Организация, ТочкаПродаж));
		
		Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_БСОНаТочке ИЗ &БСОНаТочке КАК БСОНаТочке";
		Запрос.Выполнить();
		
		Если НеобходимоНаличие Тогда
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ВТ_ТаблицаБСО.Организация,
			               |	ВТ_ТаблицаБСО.СтраховаяКомпания,
			               |	ВТ_ТаблицаБСО.ТипБСО,
			               |	ВТ_ТаблицаБСО.СерияБСО,
			               |	ВТ_ТаблицаБСО.НомерБСО,
			               |	ВТ_ТаблицаБСО.Количество,
			               |	ВТ_БСОНаТочке.ТочкаПродаж
			               |ИЗ
			               |	ВТ_ТаблицаБСО КАК ВТ_ТаблицаБСО
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БСОНаТочке КАК ВТ_БСОНаТочке
			               |		ПО ВТ_ТаблицаБСО.Организация = ВТ_БСОНаТочке.Организация
			               |			И ВТ_ТаблицаБСО.СтраховаяКомпания = ВТ_БСОНаТочке.СтраховаяКомпания
			               |			И ВТ_ТаблицаБСО.ТипБСО = ВТ_БСОНаТочке.ТипБСО
			               |			И ВТ_ТаблицаБСО.СерияБСО = ВТ_БСОНаТочке.СерияБСО
			               |			И ВТ_ТаблицаБСО.НомерБСО = ВТ_БСОНаТочке.НомерБСО
			               |ГДЕ
			               |	ВТ_БСОНаТочке.НомерБСО ЕСТЬ NULL ";
						   
			Результат = Запрос.Выполнить();
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Сообщить("Бланк " + Выборка.СерияБСО + " " + Выборка.НомерБСО + " не передан на точку продаж " + Выборка.ТочкаПродаж);
			КонецЦикла;	
				
			Возврат Результат.Пустой();
			
		Иначе	
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ВТ_ТаблицаБСО.Организация,
			               |	ВТ_ТаблицаБСО.СтраховаяКомпания,
			               |	ВТ_ТаблицаБСО.ТипБСО,
			               |	ВТ_ТаблицаБСО.СерияБСО,
			               |	ВТ_ТаблицаБСО.НомерБСО,
			               |	ВТ_ТаблицаБСО.Количество,
			               |	ВТ_БСОНаТочке.ТочкаПродаж
			               |ИЗ
			               |	ВТ_ТаблицаБСО КАК ВТ_ТаблицаБСО
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_БСОНаТочке КАК ВТ_БСОНаТочке
			               |		ПО ВТ_ТаблицаБСО.Организация = ВТ_БСОНаТочке.Организация
			               |			И ВТ_ТаблицаБСО.СтраховаяКомпания = ВТ_БСОНаТочке.СтраховаяКомпания
			               |			И ВТ_ТаблицаБСО.ТипБСО = ВТ_БСОНаТочке.ТипБСО
			               |			И ВТ_ТаблицаБСО.СерияБСО = ВТ_БСОНаТочке.СерияБСО
			               |			И ВТ_ТаблицаБСО.НомерБСО = ВТ_БСОНаТочке.НомерБСО";
						   
			Результат = Запрос.Выполнить();
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Сообщить("Бланк " + Выборка.СерияБСО + " " + Выборка.НомерБСО + " уже передан на точку продаж " + Выборка.ТочкаПродаж);
			КонецЦикла;	
				
			Возврат НЕ Результат.Пустой();
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецФункции

Функция ПроверитьНаличиеБСОНаТочках(Регистратор, ТаблицаБСО, Организация, СтраховаяКомпания = неопределено, ТочкаПродаж = неопределено, НеобходимоНаличие = ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.УстановитьПараметр("ТаблицаБСО", ТаблицаБСО);
	
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ТаблицаБСО ИЗ &ТаблицаБСО КАК ТаблицаБСО";
	Запрос.Выполнить();
	
	//Если ТочкаПродаж = неопределено Тогда
	//	
	//	Запрос.УстановитьПараметр("БСОВОрганизации", ПолучитьБСОВОрганизации(Дата, Организация));
	//	
	//	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_БСОВОрганизации ИЗ &БСОВОрганизации КАК БСОВОрганизации";
	//	Запрос.Выполнить();
	//	
	//	Если НеобходимоНаличие Тогда
	//		
	//		Запрос.Текст = "ВЫБРАТЬ
	//					   |	ВТ_ТаблицаБСО.Организация,
	//					   |	ВТ_ТаблицаБСО.СтраховаяКомпания,
	//					   |	ВТ_ТаблицаБСО.ТипБСО,
	//					   |	ВТ_ТаблицаБСО.СерияБСО,
	//					   |	ВТ_ТаблицаБСО.НомерБСО,
	//					   |	ВТ_ТаблицаБСО.Количество
	//					   |ИЗ
	//					   |	ВТ_ТаблицаБСО КАК ВТ_ТаблицаБСО
	//					   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БСОВОрганизации КАК ВТ_БСОВОрганизации
	//					   |		ПО ВТ_ТаблицаБСО.Организация = ВТ_БСОВОрганизации.Организация
	//					   |			И ВТ_ТаблицаБСО.СтраховаяКомпания = ВТ_БСОВОрганизации.СтраховаяКомпания
	//					   |			И ВТ_ТаблицаБСО.ТипБСО = ВТ_БСОВОрганизации.ТипБСО
	//					   |			И ВТ_ТаблицаБСО.СерияБСО = ВТ_БСОВОрганизации.СерияБСО
	//					   |			И ВТ_ТаблицаБСО.НомерБСО = ВТ_БСОВОрганизации.НомерБСО
	//					   |ГДЕ
	//					   |	ВТ_БСОВОрганизации.НомерБСО ЕСТЬ NULL ";
	//					   
	//		Результат = Запрос.Выполнить();
	//		
	//		Выборка = Результат.Выбрать();
	//		Пока Выборка.Следующий() Цикл
	//			Сообщить("Бланк " + Выборка.СерияБСО + " " + Выборка.НомерБСО + " не принят в организацию");
	//		КонецЦикла;	
	//			
	//		Возврат Результат.Пустой();
	//		
	//	Иначе	
	//	
	//		Запрос.Текст = "ВЫБРАТЬ
	//					   |	ВТ_ТаблицаБСО.Организация,
	//					   |	ВТ_ТаблицаБСО.СтраховаяКомпания,
	//					   |	ВТ_ТаблицаБСО.ТипБСО,
	//					   |	ВТ_ТаблицаБСО.СерияБСО,
	//					   |	ВТ_ТаблицаБСО.НомерБСО,
	//					   |	ВТ_ТаблицаБСО.Количество
	//					   |ИЗ
	//					   |	ВТ_ТаблицаБСО КАК ВТ_ТаблицаБСО
	//					   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_БСОВОрганизации КАК ВТ_БСОВОрганизации
	//					   |		ПО ВТ_ТаблицаБСО.Организация = ВТ_БСОВОрганизации.Организация
	//					   |			И ВТ_ТаблицаБСО.СтраховаяКомпания = ВТ_БСОВОрганизации.СтраховаяКомпания
	//					   |			И ВТ_ТаблицаБСО.ТипБСО = ВТ_БСОВОрганизации.ТипБСО
	//					   |			И ВТ_ТаблицаБСО.СерияБСО = ВТ_БСОВОрганизации.СерияБСО
	//					   |			И ВТ_ТаблицаБСО.НомерБСО = ВТ_БСОВОрганизации.НомерБСО";
	//					   
	//		Результат = Запрос.Выполнить();
	//		
	//		Выборка = Результат.Выбрать();
	//		Пока Выборка.Следующий() Цикл
	//			Сообщить("Бланк " + Выборка.СерияБСО + " " + Выборка.НомерБСО + " уже принят в организацию");
	//		КонецЦикла;	
	//			
	//		Возврат НЕ Результат.Пустой();
	//		
	//	КонецЕсли;	
	//	
	//Иначе
		
		Запрос.УстановитьПараметр("БСОНаТочке", ПолучитьБСОНаТочках(Организация));
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		
		Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_БСОНаТочке ИЗ &БСОНаТочке КАК БСОНаТочке";
		Запрос.Выполнить();
		
		//Если НеобходимоНаличие Тогда
		//	
		//	Запрос.Текст = "ВЫБРАТЬ
		//				   |	ВТ_ТаблицаБСО.Организация,
		//				   |	ВТ_ТаблицаБСО.СтраховаяКомпания,
		//				   |	ВТ_ТаблицаБСО.ТипБСО,
		//				   |	ВТ_ТаблицаБСО.СерияБСО,
		//				   |	ВТ_ТаблицаБСО.НомерБСО,
		//				   |	ВТ_ТаблицаБСО.Количество,
		//				   |	ВТ_БСОНаТочке.ТочкаПродаж
		//				   |ИЗ
		//				   |	ВТ_ТаблицаБСО КАК ВТ_ТаблицаБСО
		//				   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БСОНаТочке КАК ВТ_БСОНаТочке
		//				   |		ПО ВТ_ТаблицаБСО.Организация = ВТ_БСОНаТочке.Организация
		//				   |			И ВТ_ТаблицаБСО.СтраховаяКомпания = ВТ_БСОНаТочке.СтраховаяКомпания
		//				   |			И ВТ_ТаблицаБСО.ТипБСО = ВТ_БСОНаТочке.ТипБСО
		//				   |			И ВТ_ТаблицаБСО.СерияБСО = ВТ_БСОНаТочке.СерияБСО
		//				   |			И ВТ_ТаблицаБСО.НомерБСО = ВТ_БСОНаТочке.НомерБСО
		//				   |ГДЕ
		//				   |	ВТ_БСОНаТочке.НомерБСО ЕСТЬ NULL ";
		//				   
		//	Результат = Запрос.Выполнить();
		//	
		//	Выборка = Результат.Выбрать();
		//	Пока Выборка.Следующий() Цикл
		//		Сообщить("Бланк " + Выборка.СерияБСО + " " + Выборка.НомерБСО + " не передан на точку продаж " + Выборка.ТочкаПродаж);
		//	КонецЦикла;	
		//		
		//	Возврат Результат.Пустой();
		//	
		//Иначе	
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ВТ_ТаблицаБСО.Организация,
			               |	ВТ_ТаблицаБСО.СтраховаяКомпания,
			               |	ВТ_ТаблицаБСО.ТипБСО,
			               |	ВТ_ТаблицаБСО.СерияБСО,
			               |	ВТ_ТаблицаБСО.НомерБСО,
			               |	ВТ_ТаблицаБСО.Количество,
			               |	ВТ_БСОНаТочке.ТочкаПродаж,
			               |	ЕСТЬNULL(ВТ_БСОНаТочке.Количество, 0) - ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) КАК КоличествоОстаток
			               |ИЗ
			               |	ВТ_ТаблицаБСО КАК ВТ_ТаблицаБСО
			               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			               |			Renault_БСОНаТочкеПродаж.Организация КАК Организация,
			               |			Renault_БСОНаТочкеПродаж.СтраховаяКомпания КАК СтраховаяКомпания,
			               |			Renault_БСОНаТочкеПродаж.ТипБСО КАК ТипБСО,
			               |			Renault_БСОНаТочкеПродаж.СерияБСО КАК СерияБСО,
			               |			Renault_БСОНаТочкеПродаж.НомерБСО КАК НомерБСО,
			               |			Renault_БСОНаТочкеПродаж.Количество КАК Количество
			               |		ИЗ
			               |			РегистрНакопления.Renault_БСОНаТочкеПродаж КАК Renault_БСОНаТочкеПродаж
			               |		ГДЕ
			               |			Renault_БСОНаТочкеПродаж.Регистратор = &Регистратор) КАК ВложенныйЗапрос
			               |		ПО ВТ_ТаблицаБСО.Организация = ВложенныйЗапрос.Организация
			               |			И ВТ_ТаблицаБСО.СтраховаяКомпания = ВложенныйЗапрос.СтраховаяКомпания
			               |			И ВТ_ТаблицаБСО.ТипБСО = ВложенныйЗапрос.ТипБСО
			               |			И ВТ_ТаблицаБСО.СерияБСО = ВложенныйЗапрос.СерияБСО
			               |			И ВТ_ТаблицаБСО.НомерБСО = ВложенныйЗапрос.НомерБСО
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БСОНаТочке КАК ВТ_БСОНаТочке
			               |		ПО ВТ_ТаблицаБСО.Организация = ВТ_БСОНаТочке.Организация
			               |			И ВТ_ТаблицаБСО.СтраховаяКомпания = ВТ_БСОНаТочке.СтраховаяКомпания
			               |			И ВТ_ТаблицаБСО.ТипБСО = ВТ_БСОНаТочке.ТипБСО
			               |			И ВТ_ТаблицаБСО.СерияБСО = ВТ_БСОНаТочке.СерияБСО
			               |			И ВТ_ТаблицаБСО.НомерБСО = ВТ_БСОНаТочке.НомерБСО
			               |ГДЕ
			               |	ЕСТЬNULL(ВТ_БСОНаТочке.Количество, 0) - ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) > 0";
						   
			Результат = Запрос.Выполнить();
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Сообщить("Бланк " + Выборка.СерияБСО + " " + Выборка.НомерБСО + " уже передан на точку продаж " + Выборка.ТочкаПродаж);
			КонецЦикла;	
				
			Возврат НЕ Результат.Пустой();
	//		
	//	КонецЕсли;	
	//	
	//КонецЕсли;	
	
КонецФункции

Функция ПолучитьТаблицуБСОПоТабЧасти(ТабЧасть, Организация, СтраховаяКомпания = неопределено, ТочкаПродаж = неопределено, ЭтоИнтервалНомеров = истина) Экспорт
	
	Если ТабЧасть = неопределено ИЛИ ТабЧасть.Количество() = 0 Тогда
		Возврат ПолучитьПустуюТаблицуБСО();
	Иначе
		
		БСО = ПолучитьПустуюТаблицуБСО();
		
		Если ЭтоИнтервалНомеров Тогда
		
			Для Каждого Строка Из ТабЧасть Цикл
				
				ТекСтрока = Строка; // чтобы не исправлять код
				
				НомерБСО = СокрЛП(ТекСтрока.НомерБСОНач);
				
				Для Индекс = 1 По ТекСтрока.Количество Цикл
					
					НоваяСтрока = БСО.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
					НоваяСтрока.НомерБСО = НомерБСО;
					НоваяСтрока.Количество = 1; 
					НоваяСтрока.Организация = Организация;
					Если СтраховаяКомпания = неопределено Тогда
						НоваяСтрока.СтраховаяКомпания = Строка.СтраховаяКомпания;
					Иначе
						НоваяСтрока.СтраховаяКомпания = СтраховаяКомпания;
					КонецЕсли;
					Если ТочкаПродаж <> неопределено Тогда
						НоваяСтрока.ТочкаПродаж = ТочкаПродаж;
					КонецЕсли;	
					
					НомерБСО = ДобавитьКНомеру(НомерБСО, 1);
					
				КонецЦикла;	
				
				//НоваяСтрока = БСО.Добавить();
				//ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				//НоваяСтрока.НомерБСО = Строка.НомерБСОНач;
				//НоваяСтрока.Организация = Организация;
				//Если СтраховаяКомпания = неопределено Тогда
				//	НоваяСтрока.СтраховаяКомпания = Строка.СтраховаяКомпания;
				//Иначе
				//	НоваяСтрока.СтраховаяКомпания = СтраховаяКомпания;
				//КонецЕсли;
				//Если ТочкаПродаж <> неопределено Тогда
				//	НоваяСтрока.ТочкаПродаж = ТочкаПродаж;
				//КонецЕсли;	
					
			КонецЦикла;
			
		Иначе
			
			Для Каждого Строка Из ТабЧасть Цикл
				
				НоваяСтрока = БСО.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				НоваяСтрока.Количество = 1; 
				НоваяСтрока.Организация = Организация;
				Если СтраховаяКомпания = неопределено Тогда
					НоваяСтрока.СтраховаяКомпания = Строка.СтраховаяКомпания;
				Иначе
					НоваяСтрока.СтраховаяКомпания = СтраховаяКомпания;
				КонецЕсли;
				Если ТочкаПродаж <> неопределено Тогда
					НоваяСтрока.ТочкаПродаж = ТочкаПродаж;
				КонецЕсли;	
					
			КонецЦикла;
			
		КонецЕсли;	
		
		Возврат БСО;
		
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьСписокТиповБСОПоСК(СтраховаяКомпания)
	Запрос=Новый Запрос("Выбрать Различные ТипБСО Из Документ.Renault_ПоступлениеБСО.БСО ГДЕ Ссылка.Проведен И Ссылка.СтраховаяКомпания=&СтраховаяКомпания");
	Запрос.УстановитьПараметр("СтраховаяКомпания",СтраховаяКомпания);
	Сп=Новый СписокЗначений;
	Сп.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТипБСО"));
	Возврат Сп
	
	//Список = Новый СписокЗначений;
	//
	//Запрос=Новый Запрос;
	//Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	Renault_БСОСтраховыхКомпаний.ТипБСО КАК Ссылка
	//               |ИЗ
	//               |	РегистрСведений.Renault_БСОСтраховыхКомпаний КАК Renault_БСОСтраховыхКомпаний
	//               |ГДЕ
	//               |	Renault_БСОСтраховыхКомпаний.СтраховаяКомпания = &СтраховаяКомпания";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Список.Добавить(Выборка.Ссылка);	
	//КонецЦикла;	
	//
	//Возврат Список;
	
КонецФункции

Функция ПолучитьСписокСерийБСО(СтраховаяКомпания, ТипБСО)
	Запрос=Новый Запрос("Выбрать Различные СерияБСО Из Документ.Renault_ПоступлениеБСО.БСО ГДЕ Ссылка.Проведен И Ссылка.СтраховаяКомпания=&СтраховаяКомпания И ТипБСО=&ТипБСО");
	Запрос.УстановитьПараметр("СтраховаяКомпания",СтраховаяКомпания);
	Запрос.УстановитьПараметр("ТипБСО",ТипБСО);
	Сп=Новый СписокЗначений;
	Сп.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СерияБСО"));
	Возврат Сп
	
	//Список = Новый СписокЗначений;
	//
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
	//Запрос.УстановитьПараметр("ТипБСО", ТипБСО);
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	Renault_БСОСтраховыхКомпаний.СерияБСО КАК Ссылка
	//               |ИЗ
	//               |	РегистрСведений.Renault_БСОСтраховыхКомпаний КАК Renault_БСОСтраховыхКомпаний
	//               |ГДЕ
	//               |	Renault_БСОСтраховыхКомпаний.СтраховаяКомпания = &СтраховаяКомпания
	//               |	И Renault_БСОСтраховыхКомпаний.ТипБСО = &ТипБСО";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Список.Добавить(Выборка.Ссылка);	
	//КонецЦикла;	
	//
	//Возврат Список;
	
КонецФункции

//#Если ЭтоКлиент Тогда
Процедура ОбработатьНачалоВыбора(Элемент, СтандартнаяОбработка, Форма, СтраховаяКомпания, ТипБСО = неопределено) Экспорт

	СтандартнаяОбработка = ложь;
	
	Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.Renault_ТипыБСО") Тогда
		
		Если НЕ ЗначениеЗаполнено(СтраховаяКомпания) Тогда
			Сообщить("Необходимо выбрать страховую компанию",СтатусСообщения.Внимание);
			Возврат;
		КонецЕсли;	
		
		ФормаВыбора = Справочники.Renault_ТипыБСО.ПолучитьФормуВыбора();
		Список = ПолучитьСписокТиповБСОПоСК(СтраховаяКомпания);
		
	ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.Renault_СерииБСО") Тогда
		
		Если НЕ ЗначениеЗаполнено(СтраховаяКомпания) Тогда
			Сообщить("Необходимо выбрать страховую компанию",СтатусСообщения.Внимание);
			Возврат;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ТипБСО) Тогда
			Сообщить("Необходимо выбрать тип бланка",СтатусСообщения.Внимание);
			Возврат;
		КонецЕсли;	
		
		ФормаВыбора = Справочники.Renault_СерииБСО.ПолучитьФормуВыбора();
		Список = ПолучитьСписокСерийБСО(СтраховаяКомпания, ТипБСО);
		
	КонецЕсли;	
	
	ФормаВыбора.СправочникСписок.Отбор.Ссылка.ВидСравнения = ВидСравнения.ВСписке;
	ФормаВыбора.СправочникСписок.Отбор.Ссылка.Значение = Список;
	ФормаВыбора.СправочникСписок.Отбор.Ссылка.Использование = Истина;
		
	Элемент.Значение = ФормаВыбора.ОткрытьМодально();

КонецПроцедуры	
//#КонецЕсли

Процедура ЗаполнитьПоследнийНомерБСО(ТекСтрока) Экспорт
	
	Если ПустаяСтрока(ТекСтрока.НомерБСОНач) Тогда
		ТекСтрока.НомерБСОКон = "";
		Возврат;
	КонецЕсли;	
	
	Если ТекСтрока.Количество = 1 Тогда
		ТекСтрока.НомерБСОКон = ТекСтрока.НомерБСОНач;
	ИначеЕсли ТекСтрока.Количество = 0 Тогда
		ТекСтрока.НомерБСОКон = "";
	Иначе	
		НомерНач = ТекСтрока.НомерБСОНач;
		Количество = ТекСтрока.Количество;
		НомерНачЧисло = Число(НомерНач);
		//КоличествоНулейДо = 0;
		Суффикс = СтрЗаменить(НомерНач, " ", "");
		//ДлинаНомера = СтрДлина(НомерНач);
		ЛевСимвол = "";
		Префикс = "";
		Пока истина Цикл
			ЛевСимвол = Лев(Суффикс, 1);
			Суффикс = Прав(Суффикс, СтрДлина(Суффикс) - 1);
			Если ЛевСимвол <> "0" Тогда
				Прервать;
			КонецЕсли;
			Префикс = Префикс + "0"; 
		КонецЦикла;	
		
		НомерКонЧисло = НомерНачЧисло + Количество - 1;
		
		НомерКон = Префикс + Строка(НомерКонЧисло);
		
		ТекСтрока.НомерБСОКон = Прав(СтрЗаменить(НомерКон, Символы.НПП, ""), СтрДлина(СтрЗаменить(НомерНач, " ", "")));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьНомераБланков(ТекСтрока, НомераБланков) Экспорт
	
	Если ТекСтрока = неопределено ИЛИ ПустаяСтрока(ТекСтрока.НомерБСОНач) ИЛИ ТекСтрока.Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	НомерБСО = СокрЛП(ТекСтрока.НомерБСОНач);	
	//НаименованиеБСО = "" + ТекСтрока.ТипБСО + " " + ТекСтрока.СерияБСО + " " + НомерБСО; 
	//Отбор.Вставить("На", ТекСтрока.ТипБСО);
	//Отбор.Вставить("СерияБСО", ТекСтрока.СерияБСО);
	Для Индекс = 1 По ТекСтрока.Количество Цикл 
		НаименованиеБСО = "" + ТекСтрока.ТипБСО + " " + ТекСтрока.СерияБСО + " " + НомерБСО; 
		Отбор.Вставить("НаименованиеБСО", НаименованиеБСО);
		МассивСтрок = НомераБланков.НайтиСтроки(Отбор);
		Для Каждого Строка Из МассивСтрок Цикл
			НомераБланков.Удалить(Строка);	
		КонецЦикла;	
		//Индекс = Индекс + 1;
		НомерБСО = ДобавитьКНомеру(НомерБСО, 1);
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ЗаполнитьНомераБланков(ТекСтрока, НомераБланков) Экспорт
	
	Если ТекСтрока = неопределено ИЛИ ПустаяСтрока(ТекСтрока.НомерБСОНач) ИЛИ ТекСтрока.Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НомерБСО = СокрЛП(ТекСтрока.НомерБСОНач);
	
	Для Индекс = 1 По ТекСтрока.Количество Цикл
		
		НоваяСтрока = НомераБланков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.НомерБСО = НомерБСО;
		НоваяСтрока.Количество = 1; 
		НоваяСтрока.НаименованиеБСО = "" + ТекСтрока.ТипБСО + " " + ТекСтрока.СерияБСО + " " + НомерБСО; 
		
		НомерБСО = ДобавитьКНомеру(НомерБСО, 1);
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ДобавитьКНомеру(НомерБСО, Значение)
	
	НомерНач = НомерБСО;
	Количество = 1;
	НомерНачЧисло = Число(НомерНач);
	//КоличествоНулейДо = 0;
	Суффикс = СтрЗаменить(НомерНач, " ", "");
	//ДлинаНомера = СтрДлина(НомерНач);
	ЛевСимвол = "";
	Префикс = "";
	Пока истина Цикл
		ЛевСимвол = Лев(Суффикс, 1);
		Суффикс = Прав(Суффикс, СтрДлина(Суффикс) - 1);
		Если ЛевСимвол <> "0" Тогда
			Прервать;
		КонецЕсли;
		Префикс = Префикс + "0"; 
	КонецЦикла;	
	
	НомерКонЧисло = НомерНачЧисло + Количество;
	
	НомерКон = Префикс + Строка(НомерКонЧисло);
	
	НомерБСОКон = Прав(СтрЗаменить(НомерКон, Символы.НПП, ""), СтрДлина(СтрЗаменить(НомерНач, " ", "")));
	
	Возврат НомерБСОКон;
	
КонецФункции
